Results/Verifications/S2427/bottleneck-determination/read_only/threads-36/sysbench.log
$ time sysbench --config-file=sysbench.conf --threads=36 oltp_read_only --tables=32 --table-size=1000000 --db-ps-mode=auto --rand-type=
uniform run
sysbench 1.0.20 (using system LuaJIT 2.1.1700206165)

Running the test with following options:
Number of threads: 36
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 36 tps: 243.36 qps: 3926.40 (r/w/o: 3436.27/0.00/490.12) lat (ms,95%): 272.27 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 36 tps: 306.02 qps: 4898.19 (r/w/o: 4286.15/0.00/612.04) lat (ms,95%): 155.80 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 36 tps: 249.20 qps: 3986.99 (r/w/o: 3488.49/0.00/498.50) lat (ms,95%): 267.41 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 36 tps: 270.60 qps: 4332.13 (r/w/o: 3790.82/0.00/541.30) lat (ms,95%): 231.53 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 36 tps: 286.10 qps: 4576.47 (r/w/o: 4004.37/0.00/572.10) lat (ms,95%): 170.48 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 36 tps: 255.30 qps: 4090.98 (r/w/o: 3580.28/0.00/510.70) lat (ms,95%): 227.40 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 36 tps: 294.80 qps: 4708.12 (r/w/o: 4118.51/0.00/589.60) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 36 tps: 256.90 qps: 4114.37 (r/w/o: 3600.68/0.00/513.70) lat (ms,95%): 257.95 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 36 tps: 267.30 qps: 4280.22 (r/w/o: 3745.62/0.00/534.60) lat (ms,95%): 231.53 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 36 tps: 290.02 qps: 4633.98 (r/w/o: 4054.05/0.00/579.94) lat (ms,95%): 170.48 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            381262
        write:                           0
        other:                           54466
        total:                           435728
    transactions:                        27233  (272.03 per sec.)
    queries:                             435728 (4352.45 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          100.1076s
    total number of events:              27233

Latency (ms):
         min:                                   56.66
         avg:                                  132.26
         max:                                 2614.72
         95th percentile:                      215.44
         sum:                              3601832.45

Threads fairness:
    events (avg/stddev):           756.4722/5.98
    execution time (avg/stddev):   100.0509/0.03


real    1m40.556s
user    0m19.116s
sys     0m21.036s